In [137]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, inspect
from functools import reduce

pd.options.display.float_format = "{:,.2f}".format

In [138]:
avgtemp_file = "Resources\GlobalLandTemperaturesByCountry.csv\GlobalLandTemperaturesByCountry.csv"
popdf_file = "Resources\population_total_long.csv"

avgtemp_df = pd.read_csv(avgtemp_file)
popdf = pd.read_csv(popdf_file)

In [139]:
avgtemp_df.dropna()

avgtemp_df=avgtemp_df.dropna()

In [140]:
avgtemp_df['dt'] = pd.to_datetime(avgtemp_df['dt'])
avgtemp_df.head()

          dt  AverageTemperature  AverageTemperatureUncertainty Country
0 1743-11-01                4.38                           2.29   Åland
5 1744-04-01                1.53                           4.68   Åland
6 1744-05-01                6.70                           1.79   Åland
7 1744-06-01               11.61                           1.58   Åland
8 1744-07-01               15.34                           1.41   Åland

In [141]:
avgtemp_df['Day'] = avgtemp_df['dt'].dt.day
avgtemp_df['Month'] = avgtemp_df['dt'].dt.month
avgtemp_df['Year'] = avgtemp_df['dt'].dt.year

avgtemp_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Day,Month,Year
0,1743-11-01,4.38,2.29,Åland,1,11,1743
5,1744-04-01,1.53,4.68,Åland,1,4,1744
6,1744-05-01,6.70,1.79,Åland,1,5,1744
7,1744-06-01,11.61,1.58,Åland,1,6,1744
8,1744-07-01,15.34,1.41,Åland,1,7,1744

In [142]:
avgtemp_df = avgtemp_df[(avgtemp_df.Year >= 1960) & (avgtemp_df.Year <= 2010)]

avgtemp_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Day,Month,Year
2594,1960-01-01,-4.38,0.43,Åland,1,1,1960
2595,1960-02-01,-5.23,0.38,Åland,1,2,1960
2596,1960-03-01,-2.36,0.64,Åland,1,3,1960
2597,1960-04-01,1.92,0.45,Åland,1,4,1960
2598,1960-05-01,8.50,0.29,Åland,1,5,1960

In [143]:
atdf = avgtemp_df.groupby( [ "Year", "Country"] ) ['AverageTemperature'].mean().to_frame().reset_index()

atdf.head()

   Year         Country  AverageTemperature
0  1960     Afghanistan               13.99
1  1960          Africa               24.31
2  1960         Albania               13.34
3  1960         Algeria               23.50
4  1960  American Samoa               26.77

In [144]:
temppop = [atdf, popdf]

temppop = reduce(lambda left,right: pd.merge(left, right, left_index=True,right_index=True), temppop)

temppop.head()

   Year_x         Country  AverageTemperature Country Name  Year_y    Count
0    1960     Afghanistan               13.99        Aruba    1960    54211
1    1960          Africa               24.31  Afghanistan    1960  8996973
2    1960         Albania               13.34       Angola    1960  5454933
3    1960         Algeria               23.50      Albania    1960  1608800
4    1960  American Samoa               26.77      Andorra    1960    13411

In [145]:
temppop.to_csv('temppop.csv')